### 집합의 연산
a = set([1, 2, 3, 4, 5])
b = set([3, 4, 5, 6, 7])

print(a | b) # 합집합
print(a & b) # 교집합
print(a - b) # 차집합

# -------------------------------

### 집합의 메서드
data = set([1, 2, 3])

print("-------------------------------")
print(data)
print("-------------------------------")

# 새로운 원소 추가
data.add(4)
print("-------------------------------")
print("Add 4: ")
print(data)
print("-------------------------------")

# 새로운 원소 여러 개 추가
data.update([5, 6])
print("-------------------------------")
print("Add 5, 6: ")
print(data)
print("-------------------------------")

# 특정한 값을 갖는 원소 삭제
data.remove(3)
print("-------------------------------")
print("Remove 3: ")
print(data)
print("-------------------------------")
